tests/reports/_res/artillery-cluster.txt
tests  (git)-[main]- ➤ pnpm test:load:local

> tests@1.0.0 test:load:local /Users/subhajitgorai/Codes/PROJECTS/opencanvas/tests
> artillery run load-test.yml -e local

Test run id: tw6ge_xg39nxrfj5kng3qb4yhntgzhwq3n5_jcnh
Phase started: DB stress - no cache possible (index: 0, duration: 30s) 09:28:52(+0530)

--------------------------------------
Metrics for period to: 09:29:00(+0530) (width: 6.874s)
--------------------------------------

http.codes.200: ................................................................ 515
http.downloaded_bytes: ......................................................... 6213236
http.request_rate: ............................................................. 79/sec
http.requests: ................................................................. 516
http.response_time:
  min: ......................................................................... 1
  max: ......................................................................... 13
  mean: ........................................................................ 2.1
  median: ...................................................................... 2
  p95: ......................................................................... 4
  p99: ......................................................................... 7.9
http.response_time.2xx:
  min: ......................................................................... 1
  max: ......................................................................... 13
  mean: ........................................................................ 2.1
  median: ...................................................................... 2
  p95: ......................................................................... 4
  p99: ......................................................................... 7.9
http.responses: ................................................................ 515
vusers.completed: .............................................................. 338
vusers.created: ................................................................ 339
vusers.created_by_name.Cursor pagination stress: ............................... 177
vusers.created_by_name.True cache miss - unique limit per request: ............. 162
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 3.1
  max: ......................................................................... 52
  mean: ........................................................................ 6.7
  median: ...................................................................... 6
  p95: ......................................................................... 10.3
  p99: ......................................................................... 22


--------------------------------------
Metrics for period to: 09:29:10(+0530) (width: 9.998s)
--------------------------------------

http.codes.200: ................................................................ 744
http.downloaded_bytes: ......................................................... 9090119
http.request_rate: ............................................................. 75/sec
http.requests: ................................................................. 744
http.response_time:
  min: ......................................................................... 1
  max: ......................................................................... 17
  mean: ........................................................................ 1.9
  median: ...................................................................... 2
  p95: ......................................................................... 3
  p99: ......................................................................... 3
http.response_time.2xx:
  min: ......................................................................... 1
  max: ......................................................................... 17
  mean: ........................................................................ 1.9
  median: ...................................................................... 2
  p95: ......................................................................... 3
  p99: ......................................................................... 3
http.responses: ................................................................ 744
vusers.completed: .............................................................. 500
vusers.created: ................................................................ 500
vusers.created_by_name.Cursor pagination stress: ............................... 244
vusers.created_by_name.True cache miss - unique limit per request: ............. 256
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 3
  max: ......................................................................... 35.4
  mean: ........................................................................ 5.6
  median: ...................................................................... 5.5
  p95: ......................................................................... 7.3
  p99: ......................................................................... 9.5


Phase completed: DB stress - no cache possible (index: 0, duration: 30s) 09:29:22(+0530)

--------------------------------------
Metrics for period to: 09:29:20(+0530) (width: 9.998s)
--------------------------------------

http.codes.200: ................................................................ 747
http.downloaded_bytes: ......................................................... 9112524
http.request_rate: ............................................................. 76/sec
http.requests: ................................................................. 746
http.response_time:
  min: ......................................................................... 1
  max: ......................................................................... 111
  mean: ........................................................................ 5.6
  median: ...................................................................... 2
  p95: ......................................................................... 22.9
  p99: ......................................................................... 59.7
http.response_time.2xx:
  min: ......................................................................... 1
  max: ......................................................................... 111
  mean: ........................................................................ 5.6
  median: ...................................................................... 2
  p95: ......................................................................... 22.9
  p99: ......................................................................... 59.7
http.responses: ................................................................ 747
vusers.completed: .............................................................. 501
vusers.created: ................................................................ 500
vusers.created_by_name.Cursor pagination stress: ............................... 246
vusers.created_by_name.True cache miss - unique limit per request: ............. 254
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 3.4
  max: ......................................................................... 224.9
  mean: ........................................................................ 13.3
  median: ...................................................................... 6.2
  p95: ......................................................................... 48.9
  p99: ......................................................................... 133


--------------------------------------
Metrics for period to: 09:29:30(+0530) (width: 3.3s)
--------------------------------------

http.codes.200: ................................................................ 236
http.downloaded_bytes: ......................................................... 2881601
http.request_rate: ............................................................. 77/sec
http.requests: ................................................................. 236
http.response_time:
  min: ......................................................................... 1
  max: ......................................................................... 7
  mean: ........................................................................ 2.2
  median: ...................................................................... 2
  p95: ......................................................................... 3
  p99: ......................................................................... 5
http.response_time.2xx:
  min: ......................................................................... 1
  max: ......................................................................... 7
  mean: ........................................................................ 2.2
  median: ...................................................................... 2
  p95: ......................................................................... 3
  p99: ......................................................................... 5
http.responses: ................................................................ 236
vusers.completed: .............................................................. 161
vusers.created: ................................................................ 161
vusers.created_by_name.Cursor pagination stress: ............................... 75
vusers.created_by_name.True cache miss - unique limit per request: ............. 86
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 3.9
  max: ......................................................................... 19.7
  mean: ........................................................................ 6.3
  median: ...................................................................... 6.1
  p95: ......................................................................... 8.8
  p99: ......................................................................... 15.3


All VUs finished. Total time: 33 seconds

--------------------------------
Summary report @ 09:29:26(+0530)
--------------------------------

http.codes.200: ................................................................ 2242
http.downloaded_bytes: ......................................................... 27297480
http.request_rate: ............................................................. 77/sec
http.requests: ................................................................. 2242
http.response_time:
  min: ......................................................................... 1
  max: ......................................................................... 111
  mean: ........................................................................ 3.2
  median: ...................................................................... 2
  p95: ......................................................................... 6
  p99: ......................................................................... 30.9
http.response_time.2xx:
  min: ......................................................................... 1
  max: ......................................................................... 111
  mean: ........................................................................ 3.2
  median: ...................................................................... 2
  p95: ......................................................................... 6
  p99: ......................................................................... 30.9
http.responses: ................................................................ 2242
vusers.completed: .............................................................. 1500
vusers.created: ................................................................ 1500
vusers.created_by_name.Cursor pagination stress: ............................... 742
vusers.created_by_name.True cache miss - unique limit per request: ............. 758
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 3
  max: ......................................................................... 224.9
  mean: ........................................................................ 8.5
  median: ...................................................................... 5.9
  p95: ......................................................................... 22
  p99: ......................................................................... 71.5